[
  {
    "date": "2025-07-24",
    "project": "About AI",
    "article": {
      "title": "Trump’s plan to win AI race includes killing off ‘woke’ agenda and removing environmental barriers to innovation",
      "link": "https://www.fastcompany.com/91373595/trump-ai-speech-calls-for-killing-off-woke-agenda-cutting-red-tape",
      "description": "<p>President <a href=\"https://www.fastcompany.com/section/donald-trump\">Donald Trump</a> declared Wednesday that the United States will “win” the <a href=\"https://www.fastcompany.com/section/ai\">artificial intelligence</a> race. He made the declaration before signing three executive orders aimed at expediting <a href=\"https://www.fastcompany.com/section/artificial-intelligence\" title=\"AI\">AI</a>-related infrastructure projects, promoting and exporting American-made AI technology, and preventing “woke AI” in the federal government.&nbsp;</p>\n\n\n\n<p>Earlier in the day, the White House released a 28-page <a href=\"https://www.whitehouse.gov/wp-content/uploads/2025/07/Americas-AI-Action-Plan.pdf/https://www.whitehouse.gov/wp-content/uploads/2025/07/Americas-AI-Action-Plan.pdf\">AI Action Plan</a>, which lays out a detailed policy agenda to accelerate AI innovation, build AI infrastructure, and lead in international AI diplomacy and security. </p>\n\n\n\n<p>The plan paints a bucolic picture of sorts, in which American workers will benefit from the opportunities created by this technological revolution, including high-paying jobs and scientific discoveries, while the private sector is unencumbered by bureaucratic red tape and onerous regulations.</p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n\n</div></figure>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-whatever-it-takes\">&#8216;Whatever it takes&#8217;</h2>\n\n\n\n<p>But Trump also made clear that his AI policy marks a stark departure from the AI guardrails endorsed by President <a href=\"https://www.fastcompany.com/section/joe-biden\">Joe Biden</a>. During a speech Wednesday at an event cohosted by the Hill and Valley Forum and the <em>All-In</em> podcast, Trump took swipes at a number of policies endorsed by his political opponents and told the audience, “We’re getting rid of woke.”</p>\n\n\n\n<p>The White House’s AI agenda outlines risks to innovation from anything perceived as a hindrance—be it ideological policies or environmental regulations—and the executive orders continue a pattern of Trump revoking the policies of his predecessor. The president vowed to do “whatever it takes” to lead the world in AI innovation.&nbsp;</p>\n\n\n\n<p>“With your help, that golden age will be built by American workers, it will be powered by American energy, it will be run on American technology improved by American artificial intelligence, and it will make America richer, stronger, greater, freer, and more powerful than ever before,” he told the tech-heavy audience. </p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-recommended-policy-actions\">Recommended policy actions</h2>\n\n\n\n<p>Among dozens of recommended policy actions, the AI Action Plan calls for eliminating references to misinformation, <a href=\"https://www.fastcompany.com/section/dei\">diversity, equity and inclusion (DEI)</a>, and climate change. What’s more, it notes that AI models must be built on what are referred to as “American values,” without providing specifics about what those values are.</p>\n\n\n\n<p>One of the <a href=\"https://www.whitehouse.gov/presidential-actions/executive-orders/\">executive orders</a> that Trump signed Wednesday also calls for modifying various environmental regulations to streamline and accelerate the federal permitting of data center infrastructure.&nbsp;</p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-silicon-valley-s-role\">Silicon Valley&#8217;s role</h2>\n\n\n\n<p>Trump’s AI policy was <a href=\"https://www.fastcompany.com/91373066/how-silicon-valley-billionaires-shaped-trumps-new-ai-agenda\">heavily shaped by his Silicon Valley donors</a>, including <a href=\"https://www.fastcompany.com/section/david-sacks\">David Sacks</a>, one of four cohosts of the <em>All-In</em> podcast and Trump’s special adviser for AI and crypto.</p>\n\n\n\n<p>While Trump complimented the “genius and creativity” of <a href=\"https://www.fastcompany.com/section/silicon-valley\">Silicon Valley</a>, he also called on change from the technology community. “Winning the new AI race will demand a new spirit of patriotism and national loyalty in Silicon Valley.”</p>\n\n\n\n<p>More than 100 groups—including the American Federation of Teachers (AFT), the National Organization for Women (NOW), and Oxfam America—<a href=\"https://peoplesaiaction.com/\">signed a resolution</a> opposing the AI action plan, which they describe as being written by Big Tech and Big Oil. These groups instead advocated for a “People’s AI Action Plan.&#8221;&nbsp;</p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-just-popped-out-of-the-air\">&#8216;Just popped out of the air&#8217;</h2>\n\n\n\n<p>But even Trump seemed, at times, dubious or just naive about the technological revolution he intends to lead. Though AI technology is hardly new, Trump said it was “something that nobody expected, it just popped out of the air” and also suggested that AI needs a new moniker because he doesn’t like the word “artificial” and prefers the word “genius” instead.&nbsp;</p>\n\n\n\n<p>“Whether we like it or not, we’re suddenly engaged in a fast-paced competition to build and define this groundbreaking technology that will determine so much about the future of civilization itself,” he told the audience.</p>",
      "source": "Fast Company",
      "published": "2025-07-24T13:45:00",
      "image": "https://images.fastcompany.com/image/upload/w_1280,q_auto,f_auto,fl_lossy/f_webp,q_auto,c_fit/wp-cms-2/2025/07/p-1-91373595-Trump-AI-speech.jpg"
    },
    "summary": "President Donald Trump announced his plan to accelerate the development of artificial intelligence (AI) in the United States, declaring that the country will \"win\" the AI race. To achieve this, Trump signed three executive orders aimed at expediting AI-related infrastructure projects, promoting and exporting American-made AI technology, and preventing \"woke AI\" in the federal government.\n\nThe White House released a 28-page AI Action Plan, which outlines a detailed policy agenda to accelerate AI innovation, build AI infrastructure, and lead in international AI diplomacy and security. The plan emphasizes the benefits of AI, including high-paying jobs, scientific discoveries, and increased productivity. However, critics have argued that the plan prioritizes the interests of big tech companies and fossil fuel industries over those of workers, the environment, and social justice.\n\nTrump's plan marks a departure from the AI guardrails endorsed by his predecessor, President Joe Biden. Trump has vowed to eliminate references to misinformation, diversity, equity, and inclusion (DEI), and climate change, and has called for modifying environmental regulations to streamline the permitting of data center infrastructure.\n\nThe AI Action Plan has been criticized by over 100 groups, including the American Federation of Teachers, the National Organization for Women, and Oxfam America, who argue that the plan was written by big tech and big oil and that it prioritizes corporate interests over people and the planet. Instead, these groups advocate for a \"People's AI Action Plan\" that would prioritize social justice and sustainability.\n\nTrump's plan has also been shaped by his Silicon Valley donors, including David Sacks, a cohost of the All-In podcast and Trump's special adviser for AI and crypto. Trump has called on Silicon Valley to adopt a new spirit of patriotism and national loyalty, and has praised the \"genius and creativity\" of the technology community.\n\nHowever, Trump has also shown a lack of understanding about the technological revolution he intends to lead. He has referred to AI as a new and unexpected phenomenon that \"popped out of the air\" and has suggested that it needs a new name because he doesn't like the word \"artificial.\" Despite this, Trump has vowed to do \"whatever it takes\" to lead the world in AI innovation and has called on the tech community to support his efforts.\n\nOverall, Trump's AI plan has been met with criticism and skepticism, with many arguing that it is a cynical attempt to rollback progressive policies and advance the interests of big tech and big oil."
  }
]