[
  {
    "date": "2025-07-24",
    "project": "google",
    "article_count": 8,
    "report": "Google announced significant investments in artificial intelligence (AI) infrastructure, increasing capital expenditure to $85 billion this year to build and expand its AI capabilities. The company's AI-powered features, such as virtual try-on and AI Mode, aim to enhance the shopping experience on its platform. Additionally, Google revealed that its AI systems are processing an unprecedented 980 trillion \"tokens\" monthly, highlighting the growing demand for AI compute.\n\nGoogle's AI Master Plan involves a \"full-stack approach\" to AI, controlling the entire technology pipeline from chip design to data center infrastructure. This strategy has created a powerful competitive moat, allowing Google to dominate the AI landscape. The company's AI-powered virtual try-on feature, now live on Google Search, uses machine learning to render clothing items on users' bodies. AI Mode, another new feature, generates images of outfits and decor ideas based on user descriptions.\n\nThe day's news also saw Tesla's humanoid robot project, Optimus, facing delays and challenges. The project's slow pace and high costs have raised concerns about its feasibility, with industry experts arguing that specialized, purpose-built automation is often more efficient and cost-effective. In contrast, Chinese companies like Unitree and AgiBot have seen significant success in the humanoid robot market.\n\nINSIGHT: The day's developments highlight the significant investments being made in AI infrastructure and applications. As AI-powered features become increasingly prevalent, companies like Google are poised to dominate the landscape. The challenge for competitors will be to match Google's extensive investments and strategic approach. The impact on industries such as e-commerce, transportation, and manufacturing will be significant, with AI-powered solutions set to transform the way we live and work.",
    "summaries": [
      "Source: MarketWatch\nTitle: Google just gave a big boost to its AI spending. Why Meta and Amazon could follow.\nDate: Thu, 24 Jul 2025 14:22:00 GMT\nSummary:\nThe article discusses the recent announcement by Google to increase its spending on artificial intelligence (AI), and how other major technology companies, such as Meta and Amazon, may also follow suit. According to analysts, new tax provisions are providing large technology companies with more flexibility to invest in AI infrastructure, including chips, and other related technologies.\n\nThe article suggests that Google's decision to boost its AI spending is partly due to the relaxation of tax rules that were previously hindering the company's ability to invest in AI research and development. The new tax provisions are expected to give Google, as well as other large technology companies, more flexibility to allocate its funds towards AI-related expenses.\n\nMoreover, the article highlights that other technology companies, such as Meta and Amazon, may also benefit from these tax provisions and follow Google's lead in increasing their AI spending. Meta, Amazon, and other major tech companies are also heavily invested in AI research and development, and the new tax provisions could provide them with the necessary resources to accelerate their AI initiatives.\n\nIn summary, the article concludes that the recent change in tax provisions is expected to give major technology companies more flexibility to invest in AI infrastructure, which could lead to increased spending on AI research and development by companies like Google, Meta, and Amazon.\n\nKey points:\n\n* Google has announced an increase in its AI spending\n* New tax provisions are providing large technology companies with more flexibility to invest in AI infrastructure\n* The tax provisions are expected to benefit companies like Meta and Amazon, which are also heavily invested in AI research and development\n* The increased spending on AI could lead to advancements in AI technology and its adoption across various industries.\n",
      "Source: ITPro\nTitle: Alphabet to spend $10bn more this year on cloud kit — taking total to $85bn\nDate: Thu, 24 Jul 2025 13:40:07 +0000\nSummary:\nAlphabet, the parent company of Google, has announced that it will increase its capital expenditure (CapEx) by $10 billion to $85 billion this year, driven by strong demand for cloud products and services. This surprise announcement comes alongside the company's quarterly results, which showed a 14% year-over-year increase in revenue to $96.4 billion.\n\nGoogle Cloud, a key segment of Alphabet's business, saw a significant 32% year-over-year growth in revenue to $13.6 billion, with income climbing to $2.8 billion. The company attributed this growth to its Cloud Platform, AI infrastructure, and Generative AI solutions. Google Cloud's annual revenue run-rate is now over $50 billion, and the company is eager to capitalize on this momentum.\n\nAlphabet's capital expenditure boost is part of a broader trend among hyperscalers, with Meta investing $72 billion, Amazon $100 billion, and Microsoft $80 billion in CapEx this year. This increased spending has raised concerns about the high cost of AI technologies, despite their relatively limited adoption.\n\nDuring an earnings call, Alphabet's Senior Vice President and Chief Financial Officer, Anat Ashkenazi, explained that the company's CapEx spend is focused on technical infrastructure, with approximately two-thirds of investments in servers and one-third in data centers and networking equipment. Ashkenazi added that Google has had to work hard to increase capacity and has improved the pace of server deployment, but noted that a tight supply chain amid high demand for services will continue into 2026.\n\nAlphabet's CEO, Sundar Pichai, acknowledged that there will be a time delay between the company's investments and the resulting revenue, but believes it is worth spending the money now to solidify Google's success in cloud computing. Pichai pointed to the company's strong customer satisfaction and low churn rates, as well as the growing value its cloud offerings are delivering to customers.\n\nIn addition to its cloud success, Alphabet reported strong results in Search, which saw double-digit revenue growth to $54.1 billion. Pichai attributed this growth to AI-powered features such as AI Overviews, which have been popular, with over two billion monthly users. Despite the potential impact of OpenAI's ChatGPT on the search landscape, Google's monetization of new search techniques remains stable.\n\nOverall, Alphabet's increased capital expenditure commitment reflects its confidence in its cloud business and its ability to generate returns on investment. While the high cost of AI technologies may raise concerns, Alphabet's strong financial performance and growing customer base suggest that its bets on cloud computing and AI will pay off in the long run.\n",
      "Source: Gizmodo\nTitle: Google’s AI Master Plan in One Number\nDate: Thu, 24 Jul 2025 13:30:18 +0000\nSummary:\nThe article discusses Google's recent quarterly report, which showed robust growth across various segments, including Search, YouTube, and Cloud. However, the report also revealed a significant increase in Google's capital expenditures, totaling $85 billion, to build and expand its artificial intelligence (AI) infrastructure. This massive spending is aimed at accelerating the construction of data centers, filling them with specialized servers and custom-designed chips, and laying the groundwork for the company's AI ambitions.\n\nThe article highlights that the demand for AI is growing exponentially, with Google's systems processing 480 trillion \"tokens\" in May, which has more than doubled to 980 trillion monthly tokens just a few months later. This massive growth requires significant computing power, which is being fueled by the increasing use of AI applications such as image generation, document summarization, and conversational responses.\n\nGoogle's strategy is to own the entire technology pipeline, known as a \"full-stack approach to AI,\" which involves not only designing advanced AI models but also controlling the physical infrastructure they run on. This includes its global network of AI-optimized data centers and custom-designed Tensor Processing Units (TPUs), which give Google a significant advantage over competitors in terms of performance and cost.\n\nThe author argues that this control over the full stack creates a powerful competitive moat, allowing Google to dominate the AI landscape. For instance, \"nearly all gen AI unicorns use Google Cloud,\" and advanced research labs are specifically choosing Google's TPUs to train their own models.\n\nThe article concludes that Google's $85 billion bet is a long-term strategy to build and control the foundational layer of the next era of computing. The company aims to ensure its dominance for the next decade by investing heavily in the digital equivalent of roads, power grids, and factories. Any company that wants to build a significant AI application will likely have to run it on infrastructure built by Google.\n\nThe author notes that even with this massive spending, Google is still racing to keep up with demand, with CEO Sundar Pichai warning that the company expects to remain in a tight demand-supply environment going into 2026. This reveals the intense competition in the AI arms race, with Google striving to build the necessary infrastructure to meet the growing demand for AI compute.\n\nOverall, the article suggests that Google's massive spending on AI infrastructure is a sign of the company's commitment to dominating the AI landscape and creating a sustainable competitive advantage.\n",
      "Source: CNET News\nTitle: Google's AI-Powered Virtual Try-On for Online Shopping Is Now Live\nDate: Thu, 24 Jul 2025 13:00:11 +0000\nSummary:\nGoogle has officially launched its AI-powered virtual try-on feature, \"Try On\", which is now available to the broader Google user base, not just limited to Google Labs users. This feature allows users to try on clothes virtually by uploading a photo of themselves and selecting clothing items they're interested in buying. The algorithm will then render the clothing items on the user's body, taking into account their size and shape. This process takes around 5 to 15 seconds.\n\nIn addition to Try On, Google Search will also be getting other enhanced shopping features. One of these is called \"Price Alerts\", which enables users to set up price alerts for specific items they're interested in buying. When the price of the item reaches the user-set threshold, they will receive a notification. This feature is designed to help users stay on top of changing prices and make informed purchasing decisions.\n\nAnother feature being added to Google Search is \"AI Mode\", a new vertical that is currently limited to Google Labs users. AI Mode will use AI image generation to render different clothing styles or room design options, providing users with inspiration for their purchases. It will also provide users with shoppable product listings, making it easy for them to find and buy the products they see.\n\nThe integration of AI-powered features in Google's search product is a significant shift for the company. Previously, Google focused on delivering top search results based on user keyword entries. However, with the rise of AI-powered chatbots like ChatGPT, which can answer questions directly with novel answers, Google is adapting to this new reality. The goal of this shift is to use AI to answer users' questions directly and understand their intent more effectively.\n\nIn essence, Google's new virtual try-on feature and enhanced shopping features are designed to provide users with a more seamless and personalized shopping experience. By leveraging AI-powered technology, Google aims to stay ahead of the competition and provide users with a more interactive and engaging experience.\n",
      "Source: The Verge\nTitle: Google AI Mode will generate fake clothes to help you buy real ones\nDate: 2025-07-24T09:00:00-04:00\nSummary:\nThe article discusses two new features that Google is introducing to enhance the shopping experience on its platform. The first feature is called AI Mode, which will generate images of outfits and decor ideas based on user descriptions. This feature is designed to provide a visual aid that can help users find visually similar products to what they are looking for.\n\nWhen a user searches for a specific product, such as \"a green flowy dress for a garden party,\" AI Mode will generate a series of images of different dresses in various styles that match the user's description. The user can then use these images to find the closest match to the dress they were envisioning and purchase it from an online store.\n\nThe AI Mode feature is scheduled to launch in the US this fall and will be available on Google Search and Google Shopping. Although the initial images generated by AI Mode will be fake, they will be based on real-world equivalent products that users can actually buy.\n\nThe second feature that Google is introducing is a virtual try-on tool that allows users to see what clothes look like on themselves by uploading a photo. This feature was previously introduced as an experiment in Search Labs and is now launching in Search, Google Shopping, and product results on Google Images.\n\nTo use the virtual try-on tool, users can tap on any clothing product result in Search, Shopping, or Images, select the \"try it on\" icon, and upload a full-length body photo. Google's AI will then show the user what they might look like wearing the selected apparel, giving them a more personalized experience than seeing the clothes modeled on someone else.\n\nOverall, these new features aim to enhance the shopping experience on Google by providing users with a more visual and personalized way to discover and purchase products.\n",
      "Source: Fast Company\nTitle: Tesla’s Optimus humanoid robot is still an Elon Musk pipe dream\nDate: 2025-07-24T11:00:00\nSummary:\nTesla's Optimus humanoid robot project, a key part of CEO Elon Musk's vision to revolutionize manufacturing processes, is facing numerous delays, setbacks, and challenges. Despite its ambitious goals, the program has already faced production halts due to technical issues, and its slow pace and high costs have raised concerns about its feasibility. The project's CEO has left the company, and the program has been scaled back, with a new Optimus 3 prototype expected to be ready by the end of the year. Industry experts argue that the humanoid form factor may not be suitable for industrial tasks, and that specialized, purpose-built automation is often more efficient and cost-effective.\n\nDespite these challenges, Musk remains optimistic about the project, but investors are beginning to question the feasibility of his estimates. The market for humanoid robots is expected to grow, but not at the rate Musk has predicted. In contrast to Tesla's struggles, Chinese companies like Unitree and AgiBot have seen significant success, securing major deals and deploying their products to customers. The article concludes that while the humanoid robot market is expected to continue growing, Tesla's Optimus project is lagging behind its competitors and may not meet its promised milestones. Comparing the project to the infamous Fyre Festival, the article suggests that Elon Musk's grand promises are being exposed as unrealistic.\n",
      "Source: ProPublica\nTitle: Texas Attorney General Ken Paxton Is Outsourcing More of His Office’s Work to Costly Private Lawyers\nDate: Thu, 24 Jul 2025 06:00:00 -0400\nSummary:\nTexas Attorney General Ken Paxton has been increasingly relying on private law firms to argue cases on behalf of the state, often those with personal or political ties to him. Over the past few years, Paxton has awarded more contracts to private lawyers, including contingent-fee cases that can result in large windfalls for the firms. One notable example is the case against Facebook parent company Meta, where Paxton hired Zina Bash's firm, Keller Postman, which billed $3,780 an hour, resulting in a $24,570 bill for only 6.5 hours of work.\n\nExperts and ethics scholars have expressed concerns about the lack of transparency and accountability in the process, as well as potential conflicts of interest. The article suggests that Paxton's decision to outsource more cases may be motivated by a desire to maximize profits, rather than a genuine need to access specialized expertise. Additionally, the connections between Paxton and the contract recipients raise eyebrows, including the attorney who defended him during his impeachment trial, Buzbee, who was hired by Paxton's office to pursue an antitrust suit against investment firms.\n\nPaxton's office has also awarded lucrative contracts to firms such as Norton Rose Fulbright and The Lanier Law Firm, which have contributed to Paxton's campaign funds. The article highlights the lack of transparency in the contracting process, as contracts are not put out to bid and there is no effective method for lawmakers to review or challenge the attorney general's determination that private counsel is needed.\n\nIn contrast, other states such as California and Nebraska have secured significant settlements with Google without relying on private firms. The article concludes by noting that the trend of outsourcing work to private lawyers may have detrimental effects on the state's reputation and ability to attract and retain talented in-house lawyers.\n",
      "Source: Fast Company\nTitle: This free site is like Google Maps for local food discovery\nDate: 2025-07-24T09:00:00\nSummary:\nThe article introduces a free website called TasteAtlas, which is described as a \"world food atlas\" that provides a Google Maps-like experience for discovering new local food options. The author, who has recently relocated to a new city, was impressed by the website's ability to help her find fantastic food in her new area.\n\nTasteAtlas allows users to browse by cuisine type, specific location, or region. The website features a map view that displays local dishes from around the world, as well as a \"Destinations\" tab that lets users explore specific areas. Additionally, the site offers a \"Near Me\" feature that provides human-curated recommendations for the user's current location.\n\nThe website provides a wealth of information on local food establishments, including restaurants, cafes, and specialty shops. Users can also search for specific types of cuisine, events, or products. The site is completely web-based and can be accessed from any browser or device.\n\nThe article highlights several key features of TasteAtlas, including:\n\n* A comprehensive map view that displays local dishes from around the world\n* A \"Destinations\" tab that allows users to explore specific areas\n* A \"Near Me\" feature that provides personalized recommendations based on the user's location\n* A search function that allows users to find specific types of cuisine, events, or products\n* A \"Local\" tab that provides information on local food establishments, including restaurants, cafes, and specialty shops\n\nThe author notes that TasteAtlas is completely free to use, with minimal ads and no requirement to provide personal information. The company behind the site claims that it does not sell or share user data, and that the website is a valuable resource for anyone looking to discover new and exciting food options.\n\nOverall, the article presents TasteAtlas as a valuable resource for foodies and travelers alike, providing a unique and comprehensive way to discover new local food options around the world.\n"
    ]
  },
  {
    "date": "2025-07-24",
    "project": "google",
    "article": {
      "title": "Figma’s AI app building tool is now available for everyone",
      "link": "https://www.theverge.com/news/712995/figma-make-ai-general-availability-announcement",
      "description": "Figma Make, the prompt-to-app coding tool that Figma introduced earlier this year, is now available for all users. Similar to AI coding tools like Google’s Gemini Code Assist and Microsoft’s GitHub Copilot, Figma Make allows users to build working prototypes and apps using natural language descriptions, instead of needing to have innate coding skills. While [&#8230;]",
      "source": "The Verge",
      "published": "2025-07-24T10:35:00-04:00",
      "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/07/Figma-Make-general-availability-hero.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100"
    },
    "summary": "Figma, a design and development tool, has announced that its AI-powered app building tool, Figma Make, is now available to all users, with some limitations depending on the user's subscription plan. Figma Make allows users to build working prototypes and apps using natural language descriptions, without needing to have coding skills.\n\nInitially, Figma Make was launched in beta for \"Full Seat\" users, the subscription tier that provides access to all of Figma's design products. However, it can now be accessed by all Figma users, with restrictions in place depending on their subscription plan. Users with the Full Seat plan can publish their designs created by Figma Make, while users with other plans (View, Collab, Dev, and free Starter Seat) will be limited to experimenting with Figma Make in their personal drafts.\n\nFigma Make has several features that differentiate it from similar app builder coding tools. Users can upload an image or Figma design alongside the description of what they want the AI to create, which allows for more precise control over the final result. Additionally, users can adjust individual elements like text formatting and font style using AI prompts or edit them manually.\n\nOther Figma features, including the Make and Edit image tool and the resolution boosting feature, are also leaving beta alongside Figma Make. These features use generative AI to create or manipulate images based on text descriptions.\n\nFigma is also introducing a new AI credit system, which gives users a set number of credits that can be exchanged for using the platform's AI tools. The credits are allocated based on paid membership tiers. View, Collab, and Dev Seat users will have lower credit limits, which are subject to change, while Full Seat users will have unlimited access to AI credits... for now. Figma plans to allow team admins to purchase additional credits later this year for power users who may need more.\n\nIn summary, Figma Make, an AI-powered app building tool, is now available to all Figma users, with some features and functionality limited depending on the user's subscription plan. The tool allows users to build working prototypes and apps using natural language descriptions, with advanced features like design references and adjustable individual elements. Figma is also introducing an AI credit system to manage the use of its AI tools, with varying credit limits based on paid membership tiers."
  },
  {
    "date": "2025-07-24",
    "project": "google",
    "article": {
      "title": "Try these hidden ‘NOPE’ buttons to stop AI content",
      "link": "https://www.washingtonpost.com/technology/2025/07/22/opt-out-ai-google-search-duckduckgo/",
      "description": "How to turn off AI in Google and DuckDuckGo web search results, plus a no-AI nuclear option.",
      "source": "The Washington Post - Tech",
      "published": "Tue, 22 Jul 2025 16:30:00 +0000",
      "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DV2TWVVZZJHNFP4GUROKRJ245I.jpg&w=1440"
    },
    "summary": "The article discusses ways to control AI-generated content in Google and DuckDuckGo search results, providing two lesser-known options for users who prefer to opt out of AI-generated summaries. For Google, users can use a cheat code created by Ernie Smith to access plain-vanilla search results without AI summaries by typing their search query into UDM14.com or changing their browser settings. Alternatively, users can use DuckDuckGo's new feature to filter out AI-generated material from image searches and opt out of AI-generated summaries in each image search. The article also reveals a method to turn off AI-generated content by using hidden \"NoPE\" buttons, which can be activated by clicking three dots on the right side of the screen and choosing \"Make default.\" This way, users can have more control over their search results and choose to opt out of AI-generated content."
  },
  {
    "date": "2025-07-24",
    "project": "google",
    "article": {
      "title": "Google Skips Right to Leaking the Whole Pixel 10 Lineup",
      "link": "https://gizmodo.com/google-skips-right-to-leaking-the-whole-pixel-10-lineup-2000633712",
      "description": "<img alt=\"Google Pixel 10\" class=\"attachment-full size-full wp-post-image\" height=\"1280\" src=\"https://gizmodo.com/app/uploads/2025/07/googlepixel.jpg\" width=\"1920\" /><br /><br />Not much left to the imagination now.",
      "source": "Gizmodo",
      "published": "Thu, 24 Jul 2025 15:10:39 +0000",
      "image": "https://gizmodo.com/app/uploads/2025/07/googlepixel.jpg"
    },
    "summary": "The article reports that Google has inadvertently revealed the entire Pixel 10 lineup on its Play Store, leaving little to the imagination ahead of its upcoming summer event. According to Android Authority, the images on the Play Store show the following devices:\n\n1. Pixel 10\n2. Pixel 10 Pro\n3. Pixel 10 Pro XL\n4. Pixel 10 Pro Fold\n\nThe reveal appears to be an unintentional mistake, as a banner on the Play Store reads \"Now available\" and offers a $50 discount with an October 13 deadline. This suggests that the information was meant to be kept under wraps until a later date.\n\nWhile the Pixel 10 lineup is now public, the article notes that Google's events often feature other product announcements. Some potential surprises that may still be in store for the August event include:\n\n* The Pixel Watch 3 (announced last year) or possibly the Pixel Watch 4\n* The Pixel Buds 2 Pro wireless earbuds or other new earbuds\n* New AI features, which are likely to be a major focus of the event\n\nThe article concludes that while the Pixel 10 lineup is no longer a secret, there may still be some surprises in store for Google's August event."
  },
  {
    "date": "2025-07-24",
    "project": "google",
    "article": {
      "title": "Google Seems to Have Accidentally Leaked More Pics of the Pixel 10 Series",
      "link": "https://www.cnet.com/tech/mobile/google-seems-to-have-accidentally-leaked-more-pics-of-the-pixel-10-series/#ftag=CAD590a51e",
      "description": "The company appears to have inadvertently revealed its entire Pixel 10 lineup on Google Store app with a promo image.",
      "source": "CNET News",
      "published": "Thu, 24 Jul 2025 13:38:00 +0000",
      "image": "https://www.cnet.com/a/img/resize/bc53b97644edca80806c4882e564c95141519055/hub/2025/07/21/7ad7ce5f-aa71-4723-b470-b9ff5c7ae6af/screenshot-2025-07-21-151400.png?auto=webp&fit=crop&height=614&width=1092"
    },
    "summary": "Here is a detailed summary of the article:\n\n**Google's Accidental Leak**: Google appears to have inadvertently leaked promotional images of its upcoming Pixel 10 series on the Google Play Store. The leaked image, discovered by Android Authority, shows four different models of the Pixel 10 series.\n\n**The Leaked Image**: The image is a promotional banner that features four Pixel 10 models, which are believed to be:\n\n1. Pixel 10\n2. Pixel 10 Pro\n3. Pixel 10 Pro XL\n4. Pixel 10 Pro Fold\n\n**Color Options**: The image shows three of the phones in a dark gray color, while the smallest phone, likely the Pixel 10, is depicted in a bright indigo blue color.\n\n**Promo Details**: The leaked image also includes text about a promotional offer, which provides a $50 discount that expires on October 13.\n\n**Official Response**: A Google representative did not immediately respond to an email seeking comment on the alleged leak.\n\n**Expected Launch Date**: The article mentions that Google is expected to debut its new Pixel 10 lineup on August 20, which is just a few weeks away.\n\nOverall, the article suggests that Google may have accidentally revealed more information about its upcoming Pixel 10 series, giving enthusiasts a sneak peek at the new devices ahead of their official launch."
  },
  {
    "date": "2025-07-24",
    "project": "google",
    "article": {
      "title": "Try these hidden ‘NOPE’ buttons to stop AI content",
      "link": "https://www.washingtonpost.com/technology/2025/07/22/opt-out-ai-google-search-duckduckgo/",
      "description": "How to turn off AI in Google and DuckDuckGo web search results, plus a no-AI nuclear option.",
      "source": "The Washington Post - Tech",
      "published": "Tue, 22 Jul 2025 16:30:00 +0000",
      "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DV2TWVVZZJHNFP4GUROKRJ245I.jpg&w=1440"
    },
    "summary": "**Taking Control of AI-Generated Content: Hidden 'NOPE' Buttons and Opt-Out Methods**\n\nThe increasing presence of AI-generated content in web searches has raised concerns among users who prefer a more traditional search experience. Fortunately, there are ways to opt out of AI-generated material on popular search engines like Google and DuckDuckGo.\n\n**Google Search: Opting Out of AI Summaries**\n\nUsers can access Google search results without AI summaries by visiting **UDM14.com**, a website that allows users to search Google without AI-generated content. Additionally, Chrome users can modify their browser settings to make no-AI search results the default by adding a new search engine with a specific URL.\n\n**DuckDuckGo: Filtering Out AI-Generated Material**\n\nDuckDuckGo offers a feature to filter out AI-generated material from image searches. Users can hide AI images in searches or choose this option for each image search. They can also disable AI-generated summaries in search results by choosing \"never\" for AI Assist in DuckDuckGo's settings.\n\n**Browser-Specific Instructions**\n\nWhile Chrome users can easily modify their settings to exclude AI material, these options do not work for Safari browser users. However, users can still utilize browser-specific workarounds to achieve their desired search experience.\n\n**A Simple 'NOPE' Button: Opting Out of AI Content**\n\nSome platforms and applications offer a straightforward way to opt out of AI-generated content. By accessing the menu, represented by **three dots on the right**, and selecting **“Make default,”** users can configure their preferences to stop AI-generated content from being displayed by default.\n\n**Conclusion and User Feedback**\n\nHaving control over AI-generated content can be beneficial for users who prefer a more traditional search experience. While these methods may not be foolproof and could potentially stop working, they offer a solution for users who value the ability to choose between AI-generated and traditional search results. As users continue to navigate the evolving online landscape, these opt-out methods provide a sense of agency and control over their digital experiences."
  }
]